In [45]:
import pandas as pd
import numpy as np

In [2]:
data = [['1', 'zhangsan', 80],['2', 'lisi', 90]]
df = pd.DataFrame(data, columns=['No', 'Name', 'score'])
df

  No      Name  score
0  1  zhangsan     80
1  2      lisi     90

## multiple function apply

In [3]:
def func(row):
    if row['score'] > 85:
        return 'A', 'OK' 
    else:
        return 'B', 'NO'
df[['Grade', 'Results']] = df.apply(func, axis=1, result_type='expand')
df

  No      Name  score Grade Results
0  1  zhangsan     80     B      NO
1  2      lisi     90     A      OK

## pivot table

In [129]:
data = [['zhangsan', '2016', 80],['zhangsan', '2017', 90],['zhangsan', '2018', 90],['lisi', '2016', 65],['lisi', '2018', 90],['wangwu', '2018',100]]
df = pd.DataFrame(data, columns=['Name', 'Year', 'score'])
df

       Name  Year  score
0  zhangsan  2016     80
1  zhangsan  2017     90
2  zhangsan  2018     90
3      lisi  2016     65
4      lisi  2018     90
5    wangwu  2018    100

In [130]:
pivot_df = df.pivot(index='Name', columns='Year',values='score').reset_index()
pivot_df

Year      Name  2016  2017   2018
0         lisi  65.0   NaN   90.0
1       wangwu   NaN   NaN  100.0
2     zhangsan  80.0  90.0   90.0

In [131]:
pivot_df['avg'] = pivot_df.apply(lambda x: x[['2016', '2017', '2018']].mean(), axis=1)
for i in range(len(pivot_df)):
    pivot_df.iloc[i] = pivot_df.iloc[i].fillna(pivot_df.iloc[i]['avg'])

In [132]:
pivot_df = pivot_df.drop(['avg'], axis=1)

In [133]:
pivot_df

Year      Name   2016   2017   2018
0         lisi   65.0   77.5   90.0
1       wangwu  100.0  100.0  100.0
2     zhangsan   80.0   90.0   90.0

## unpivot table

In [136]:
data = [['zhangsan', '1', 60, 80,90],['lisi', '2',57,79,90],['wangwu', '3',60,90,86]]
df = pd.DataFrame(data, columns=['Name', 'ID','2016', '2017', '2018'])
df

       Name ID  2016  2017  2018
0  zhangsan  1    60    80    90
1      lisi  2    57    79    90
2    wangwu  3    60    90    86

In [138]:
df = pd.melt(df, id_vars=['Name', 'ID'], value_vars=['2016', '2017', '2018'], var_name='Year', value_name='score')
df

       Name ID  Year  score
0  zhangsan  1  2016     60
1      lisi  2  2016     57
2    wangwu  3  2016     60
3  zhangsan  1  2017     80
4      lisi  2  2017     79
5    wangwu  3  2017     90
6  zhangsan  1  2018     90
7      lisi  2  2018     90
8    wangwu  3  2018     86